DataProcessors/InteractiveDataExchangeInModelServiceAssistant.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>InteractiveDataExchangeInModelServiceAssistant</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/SystemMessagesExchangeSessions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>SystemMessagesExchangeSessions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StartDate</Name>
					<Comment>Session start date.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CompletedSuccessfully</Name>
					<Comment>Shows that the session is successfully completed</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EndWithError</Name>
					<Comment>Shows that the session is completed unsuccessfully.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Session</Name>
					<Comment>Unique session ID</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/InteractiveDataExchangeInModelServiceAssistant/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProgramInterface

// Handler of the background job for registration of additional data and exchange
//
// Parameters:
//     ImportingHandling - DataProcessorObject.InteractiveExportChange - the
//     StorageAddress initialized object    - String, UUID - Address in storage for getting a result
// 
Procedure ExchangeOnDemand(Val ImportingHandling, Val StorageAddress = Undefined) Export
	
	RegisterExportAdditionData(ImportingHandling);
	
	Session = LaunchExchangeOnDemand(ImportingHandling.InfobaseNode);
	
	If StorageAddress <> Undefined Then
		PutToTempStorage(New Structure("Session", Session), StorageAddress);
	EndIf;
	
EndProcedure

// Registers additional data by settings
//
// Parameters:
//     ImportingHandling - Structure, DataProcessorObject.InteraractiveExportChange - initialized object
//
Procedure RegisterExportAdditionData(Val ImportingHandling)
	
	If TypeOf(ImportingHandling) = Type("Structure") Then
		DataProcessor = DataProcessors.InteractiveExportChange.Create();
		FillPropertyValues(DataProcessor, ImportingHandling, , "AdditionalRegistration, AdditionalRegistrationNodeScript");
		DataExchangeServer.FillValueTable(DataProcessor.AdditionalRegistration, ImportingHandling.AdditionalRegistration);
		DataExchangeServer.FillValueTable(DataProcessor.AdditionalRegistrationScriptSite, ImportingHandling.AdditionalRegistrationScriptSite);
	Else
		DataProcessor = ImportingHandling;
	EndIf;
	
	If DataProcessor.ExportVariant <= 0 Then
		// Do not add
		Return;
		
	ElsIf DataProcessor.ExportVariant = 1 Then
		// For a period with filter, clear additionally
		DataProcessor.AdditionalRegistration.Clear();
		
	ElsIf DataProcessor.ExportVariant = 2 Then
		// Set in details, clear general
		DataProcessor.ComposerAllDocumentsFilter = Undefined;
		DataProcessor.AllDocumentsFilterPeriod      = Undefined;
		
	EndIf;
	
	DataProcessor.RegisterAdditionalModifications();
EndProcedure

// Launches exchange on demand
//
// Parameters:
//     InfobaseNode - ExchangePlanRef - Ref to correspondent
//
Function LaunchExchangeOnDemand(Val InfobaseNode) Export
	
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Message = MessagesSaaS.NewMessage(
			MessagesDataExchangeAdministrationManagementInterface.MessagePushSynchronization()
		);
		
		Session = InformationRegisters.SystemMessagesExchangeSessions.NewSession();
		
		Message.Body.Zone      = CommonUse.SessionSeparatorValue();
		Message.Body.SessionId = Session;
		
		MessagesSaaS.SendMessage(Message, SaaSReUse.ServiceManagerEndPoint(), True);
		CommitTransaction();
	Except
		RollbackTransaction();
		
		WriteLogEvent(DataExchangeSaaS.EventLogMonitorEventDataSynchronization(), EventLogLevel.Error, , ,
			DetailErrorDescription(ErrorInfo()) 
		);
			
		Session = Undefined;
	EndTry;
	
	If Session<>Undefined Then
		MessagesSaaS.DeliverQuickMessages();
	EndIf;
	
	Return Session;
EndFunction

#EndRegion

#EndIf
